Practica 4/datos/Ab/haproxy_ab_0.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.142 (be patient)


Server Software:        Apache/2.4.18
Server Hostname:        192.168.1.142
Server Port:            80

Document Path:          /hola.html
Document Length:        62 bytes

Concurrency Level:      5
Time taken for tests:   4.405 seconds
Complete requests:      10000
Failed requests:        5000
   (Connect: 0, Receive: 0, Length: 5000, Exceptions: 0)
Total transferred:      3090000 bytes
HTML transferred:       630000 bytes
Requests per second:    2269.90 [#/sec] (mean)
Time per request:       2.203 [ms] (mean)
Time per request:       0.441 [ms] (mean, across all concurrent requests)
Transfer rate:          684.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  26.2      0    1311
Processing:     0    2   0.6      2       9
Waiting:        0    2   0.6      2       9
Total:          1    2  26.2      2    1313

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      2
  95%      2
  98%      3
  99%      3
 100%   1313 (longest request)