Practica 4/datos/Ab/nginx_ab_2.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.141 (be patient)


Server Software:        nginx/1.10.1
Server Hostname:        192.168.1.141
Server Port:            80

Document Path:          /hola.html
Document Length:        62 bytes

Concurrency Level:      5
Time taken for tests:   4.849 seconds
Complete requests:      10000
Failed requests:        5000
   (Connect: 0, Receive: 0, Length: 5000, Exceptions: 0)
Total transferred:      2990000 bytes
HTML transferred:       630000 bytes
Requests per second:    2062.40 [#/sec] (mean)
Time per request:       2.424 [ms] (mean)
Time per request:       0.485 [ms] (mean, across all concurrent requests)
Transfer rate:          602.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     1    2   0.4      2       7
Waiting:        1    2   0.4      2       6
Total:          1    2   0.4      2       8

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      3
  80%      3
  90%      3
  95%      3
  98%      4
  99%      4
 100%      8 (longest request)